{
	"description": "Add a face to a specified large face list, up to 1,000,000 faces. To deal with an image contains multiple faces, input face can be specified as an image with a targetFace rectangle. It returns a persistedFaceId representing the added face. No image will be stored. Only the extracted face feature will be stored on server until [LargeFaceList Face - Delete](/docs/services/563879b61984550e40cbbe8d/operations/5a158c8ad2de3616c086f2d4) or [LargeFaceList - Delete](/docs/services/563879b61984550e40cbbe8d/operations/5a1580d5d2de3616c086f2cd) is called. Note persistedFaceId is different from faceId generated by [Face - Detect](/docs/services/563879b61984550e40cbbe8d/operations/563879b61984550f30395236).* Higher face image quality means better recognition precision. Please consider high-quality faces: frontal, clear, and face size is 200x200 pixels (100 pixels between eyes) or bigger.* JPEG, PNG, GIF (the first frame), and BMP format are supported. The allowed image file size is from 1KB to 6MB.* 'targetFace' rectangle should contain one face. Zero or multiple faces will be regarded as an error. If the provided 'targetFace' rectangle is not returned from [Face - Detect](/docs/services/563879b61984550e40cbbe8d/operations/563879b61984550f30395236), there’s no guarantee to detect and add the face successfully.* Out of detectable face size (36x36 - 4096x4096 pixels), large head-pose, or large occlusions will cause failures.* Adding/deleting faces to/from a same face list are processed sequentially and to/from different face lists are in parallel.* The minimum detectable face size is 36x36 pixels in an image no larger than 1920x1080 pixels. Images with dimensions higher than 1920x1080 pixels will need a proportionally larger minimum face size.* Different 'detectionModel' values can be provided. To use and compare different detection models, please refer to [How to specify a detection model](https://docs.microsoft.com/en-us/azure/cognitive-services/face/face-api-how-to-topics/specify-detection-model)  | Model | Recommended use-case(s) |  | ---------- | -------- |  | 'detection_01': | The default detection model for [LargeFaceList - Add Face](/docs/services/563879b61984550e40cbbe8d/operations/5a158c10d2de3616c086f2d3). Recommend for near frontal face detection. For scenarios with exceptionally large angle (head-pose) faces, occluded faces or wrong image orientation, the faces in such cases may not be detected. |  | 'detection_02': | Detection model released in 2019 May with improved accuracy especially on small, side and blurry faces. |Quota:* Free-tier subscription quota: 1,000 faces per large face list.* S0-tier subscription quota: 1,000,000 faces per large face list.",
	"input_method": "stdin",
	"parameters":{
		
		
		
		
		    
			"detection_model":{
			   "description": "Name of detection model. Detection model is used to detect faces in the submitted image. A detection model name can be provided when performing Face - Detect or (Large)FaceList - Add Face or (Large)PersonGroup - Add Face. The default value is 'detection_01', if another model is needed, please explicitly specify it.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"error":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"large_face_list_id":{
			   "description": "Id referencing a particular large face list.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"user_data":{
			   "description": "User-specified data about the face for any purpose. The maximum length is 1KB.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"target_face":{
			   "description": "A face rectangle to specify the target face to be added to a person in the format of 'targetFace=left,top,width,height'. E.g. 'targetFace=10,10,100,100'. If there is more than one face in the image, targetFace is required to specify which face to add. No targetFace means there is only one face detected in the entire image.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"image_url":{
			   "description": "A JSON document with a URL pointing to the image that is to be analyzed.",
			   "type": "Optional[String[1]]"
			}
			
	}
}