{
	"description": "Detect human faces in an image, return face rectangles, and optionally with faceIds, landmarks, and attributes.* No image will be stored. Only the extracted face feature will be stored on server. The faceId is an identifier of the face feature and will be used in [Face - Identify](/docs/services/563879b61984550e40cbbe8d/operations/563879b61984550f30395239), [Face - Verify](/docs/services/563879b61984550e40cbbe8d/operations/563879b61984550f3039523a), and [Face - Find Similar](/docs/services/563879b61984550e40cbbe8d/operations/563879b61984550f30395237). The stored face feature(s) will expire and be deleted 24 hours after the original detection call.* Optional parameters include faceId, landmarks, and attributes. Attributes include age, gender, headPose, smile, facialHair, glasses, emotion, hair, makeup, occlusion, accessories, blur, exposure and noise. Some of the results returned for specific attributes may not be highly accurate.* JPEG, PNG, GIF (the first frame), and BMP format are supported. The allowed image file size is from 1KB to 6MB.* Up to 100 faces can be returned for an image. Faces are ranked by face rectangle size from large to small.* For optimal results when querying [Face - Identify](/docs/services/563879b61984550e40cbbe8d/operations/563879b61984550f30395239), [Face - Verify](/docs/services/563879b61984550e40cbbe8d/operations/563879b61984550f3039523a), and [Face - Find Similar](/docs/services/563879b61984550e40cbbe8d/operations/563879b61984550f30395237) ('returnFaceId' is true), please use faces that are: frontal, clear, and with a minimum size of 200x200 pixels (100 pixels between eyes).* The minimum detectable face size is 36x36 pixels in an image no larger than 1920x1080 pixels. Images with dimensions higher than 1920x1080 pixels will need a proportionally larger minimum face size.* Different 'detectionModel' values can be provided. To use and compare different detection models, please refer to [How to specify a detection model](https://docs.microsoft.com/en-us/azure/cognitive-services/face/face-api-how-to-topics/specify-detection-model)  | Model | Recommended use-case(s) |  | ---------- | -------- |  | 'detection_01': | The default detection model for [Face - Detect](/docs/services/563879b61984550e40cbbe8d/operations/563879b61984550f30395236). Recommend for near frontal face detection. For scenarios with exceptionally large angle (head-pose) faces, occluded faces or wrong image orientation, the faces in such cases may not be detected. |  | 'detection_02': | Detection model released in 2019 May with improved accuracy especially on small, side and blurry faces. |* Different 'recognitionModel' values are provided. If follow-up operations like Verify, Identify, Find Similar are needed, please specify the recognition model with 'recognitionModel' parameter. The default value for 'recognitionModel' is 'recognition_01', if latest model needed, please explicitly specify the model you need in this parameter. Once specified, the detected faceIds will be associated with the specified recognition model. More details, please refer to [How to specify a recognition model](https://docs.microsoft.com/en-us/azure/cognitive-services/face/face-api-how-to-topics/specify-recognition-model)  | Model | Recommended use-case(s) |  | ---------- | -------- |  | 'recognition_01': | The default recognition model for [Face - Detect](/docs/services/563879b61984550e40cbbe8d/operations/563879b61984550f30395236). All those faceIds created before 2019 March are bonded with this recognition model. |  | 'recognition_02': | Recognition model released in 2019 March. 'recognition_02' is recommended since its overall accuracy is improved compared with 'recognition_01'. |",
	"input_method": "stdin",
	"parameters":{
		
		
		
		
		    
			"return_recognition_model":{
			   "description": "A value indicating whether the operation should return 'recognitionModel' in response.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"detection_model":{
			   "description": "Name of detection model. Detection model is used to detect faces in the submitted image. A detection model name can be provided when performing Face - Detect or (Large)FaceList - Add Face or (Large)PersonGroup - Add Face. The default value is 'detection_01', if another model is needed, please explicitly specify it.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"error":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"return_face_id":{
			   "description": "A value indicating whether the operation should return faceIds of detected faces.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"return_face_landmarks":{
			   "description": "A value indicating whether the operation should return landmarks of the detected faces.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"return_face_attributes":{
			   "description": "Analyze and return the one or more specified face attributes in the comma-separated string like 'returnFaceAttributes=age,gender'. Supported face attributes include age, gender, headPose, smile, facialHair, glasses and emotion. Note that each face attribute analysis has additional computational and time cost.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"image_url":{
			   "description": "A JSON document with a URL pointing to the image that is to be analyzed.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"recognition_model":{
			   "description": "Name of recognition model. Recognition model is used when the face features are extracted and associated with detected faceIds, (Large)FaceList or (Large)PersonGroup. A recognition model name can be provided when performing Face - Detect or (Large)FaceList - Create or (Large)PersonGroup - Create. The default value is 'recognition_01', if latest model needed, please explicitly specify the model you need.",
			   "type": "Optional[String[1]]"
			}
			
	}
}