{
	"description": "Create a new assessment with the given name and the specified settings. Since name of an assessment in a project is a unique identifier, if an assessment with the name provided already exists, then the existing assessment is updated.Any PUT operation, resulting in either create or update on an assessment, will cause the assessment to go in a 'InProgress' state. This will be indicated by the field 'computationState' on the Assessment object. During this time no other PUT operation will be allowed on that assessment object, nor will a Delete operation. Once the computation for the assessment is complete, the field 'computationState' will be updated to 'Ready', and then other PUT or DELETE operations can happen on the assessment.When assessment is under computation, any PUT will lead to a 400 - Bad Request error.",
	"input_method": "stdin",
	"parameters":{
		
		
		
		
		    
			"assessment":{
			   "description": "New or Updated Assessment object.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"error":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"subscription_id":{
			   "description": "Azure Subscription Id in which project was created.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"resource_group_name":{
			   "description": "Name of the Azure Resource Group that project is part of.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"project_name":{
			   "description": "Name of the Azure Migrate project.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"assessment_name":{
			   "description": "Unique name of an assessment within a project.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"accept_language":{
			   "description": "Standard request header. Used by service to respond to client in appropriate language.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"group_name":{
			   "description": "Unique name of a group within a project.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"api_version":{
			   "description": "Standard request header. Used by service to identify API version used by client.",
			   "type": "Optional[String[1]]"
			}
			
	}
}