{
	"description": "Gets the status about the compose deployments that were created or in the process of being created in the Service Fabric cluster. The response includes the name, status, and other details about the compose deployments. If the list of deployments do not fit in a page, one page of results is returned as well as a continuation token, which can be used to get the next page.",
	"input_method": "stdin",
	"parameters":{
		
		
		
		
		    
			"continuation_token":{
			   "description": "The continuation token parameter is used to obtain next set of results. A continuation token with a non-empty value is included in the response of the API when the results from the system do not fit in a single response. When this value is passed to the next API call, the API returns next set of results. If there are no further results, then the continuation token does not contain a value. The value of this parameter should not be URL encoded.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"max_results":{
			   "description": "The maximum number of results to be returned as part of the paged queries. This parameter defines the upper bound on the number of results returned. The results returned can be less than the specified maximum results if they do not fit in the message as per the max message size restrictions defined in the configuration. If this parameter is zero or not specified, the paged query includes as many results as possible that fit in the return message.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"timeout":{
			   "description": "The server timeout for performing the operation in seconds. This timeout specifies the time duration that the client is willing to wait for the requested operation to complete. The default value for this parameter is 60 seconds.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"name":{
			   "description": "The name of the deployment.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"applicationname":{
			   "description": "The name of the application, including the 'fabric:' URI scheme.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"status":{
			   "description": "The status of the compose deployment.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"statusdetails":{
			   "description": "The status details of compose deployment including failure message.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"api_version":{
			   "description": "The version of the API. This parameter is required and its value must be ''6.0-preview'.",
			   "type": "Optional[String[1]]"
			}
			
	}
}