{
	"description": "Submits a batch of property operations. Either all or none of the operations will be committed.",
	"input_method": "stdin",
	"parameters":{
		
		
		
		
		    
			"api_version":{
			   "description": "The version of the API. This parameter is required and its value must be '6.0'.Service Fabric REST API version is based on the runtime version in which the API was introduced or was changed. Service Fabric runtime supports more than one version of the API. This is the latest supported version of the API. If a lower API version is passed, the returned response may be different from the one documented in this specification.Additionally the runtime accept any version that is higher than the latest supported version up to the current version of the runtime. So if the latest API version is 6.0, but if the runtime is 6.1, in order to make it easier to write the clients, the runtime will accept version 6.1 for that API. However the behavior of the API will be as per the documented 6.0 version.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"name_id":{
			   "description": "The Service Fabric name, without the 'fabric:' URI scheme.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"property_batch_description_list":{
			   "description": "Describes the property batch operations to be submitted.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"timeout":{
			   "description": "The server timeout for performing the operation in seconds. This timeout specifies the time duration that the client is willing to wait for the requested operation to complete. The default value for this parameter is 60 seconds.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"properties":{
			   "description": "A map containing the properties that were requested through any 'Get' property batch operations. The key represents the index of the 'Get' operation in the original request, in string form. The value is the property. If a property is not found, it will not be in the map.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"kind":{
			   "description": "The kind of property batch info, determined by the results of a property batch. The following are the possible values.",
			   "type": "Optional[String[1]]"
			}
			
	}
}