{
	"description": "Reports health state of the specified Service Fabric replica. The report must contain the information about the source of the health report and property on which it is reported.The report is sent to a Service Fabric gateway Replica, which forwards to the health store.The report may be accepted by the gateway, but rejected by the health store after extra validation.For example, the health store may reject the report because of an invalid parameter, like a stale sequence number.To see whether the report was applied in the health store, run GetReplicaHealth and check that the report appears in the HealthEvents section.",
	"input_method": "stdin",
	"parameters":{
		
		
		
		
		    
			"partition_id":{
			   "description": "The identity of the partition.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"replica_id":{
			   "description": "The identifier of the replica.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"service_kind":{
			   "description": "The kind of service replica (Stateless or Stateful) for which the health is being reported. Following are the possible values.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"health_information":{
			   "description": "Describes the health information for the health report. This information needs to be present in all of the health reports sent to the health manager.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"immediate":{
			   "description": "A flag that indicates whether the report should be sent immediately.A health report is sent to a Service Fabric gateway Application, which forwards to the health store.If Immediate is set to true, the report is sent immediately from HTTP Gateway to the health store, regardless of the fabric client settings that the HTTP Gateway Application is using.This is useful for critical reports that should be sent as soon as possible.Depending on timing and other conditions, sending the report may still fail, for example if the HTTP Gateway is closed or the message doesn't reach the Gateway.If Immediate is set to false, the report is sent based on the health client settings from the HTTP Gateway. Therefore, it will be batched according to the HealthReportSendInterval configuration.This is the recommended setting because it allows the health client to optimize health reporting messages to health store as well as health report processing.By default, reports are not sent immediately.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"timeout":{
			   "description": "The server timeout for performing the operation in seconds. This timeout specifies the time duration that the client is willing to wait for the requested operation to complete. The default value for this parameter is 60 seconds.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"error":{
			   "description": "Error object containing error code and error message.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"api_version":{
			   "description": "The version of the API. This parameter is required and its value must be '6.0'.Service Fabric REST API version is based on the runtime version in which the API was introduced or was changed. Service Fabric runtime supports more than one version of the API. This is the latest supported version of the API. If a lower API version is passed, the returned response may be different from the one documented in this specification.Additionally the runtime accept any version that is higher than the latest supported version up to the current version of the runtime. So if the latest API version is 6.0, but if the runtime is 6.1, in order to make it easier to write the clients, the runtime will accept version 6.1 for that API. However the behavior of the API will be as per the documented 6.0 version.",
			   "type": "Optional[String[1]]"
			}
			
	}
}