{
	"description": "The following APIs start fault operations that may be cancelled by using CancelOperation: StartDataLoss, StartQuorumLoss, StartPartitionRestart, StartNodeTransition.If force is false, then the specified user-induced operation will be gracefully stopped and cleaned up.  If force is true, the command will be aborted, and some internal statemay be left behind.  Specifying force as true should be used with care.  Calling this API with force set to true is not allowed until this API has alreadybeen called on the same test command with force set to false first, or unless the test command already has an OperationState of OperationState.RollingBack.Clarification: OperationState.RollingBack means that the system will be/is cleaning up internal system state caused by executing the command.  It will not restore data if thetest command was to cause data loss.  For example, if you call StartDataLoss then call this API, the system will only clean up internal state from running the command.It will not restore the target partition's data, if the command progressed far enough to cause data loss.Important note:  if this API is invoked with force==true, internal state may be left behind.",
	"input_method": "stdin",
	"parameters":{
		
		
		
		
		    
			"api_version":{
			   "description": "The version of the API. This parameter is required and its value must be '6.0'.Service Fabric REST API version is based on the runtime version in which the API was introduced or was changed. Service Fabric runtime supports more than one version of the API. This is the latest supported version of the API. If a lower API version is passed, the returned response may be different from the one documented in this specification.Additionally the runtime accept any version that is higher than the latest supported version up to the current version of the runtime. So if the latest API version is 6.0, but if the runtime is 6.1, in order to make it easier to write the clients, the runtime will accept version 6.1 for that API. However the behavior of the API will be as per the documented 6.0 version.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"operation_id":{
			   "description": "A GUID that identifies a call of this API.  This is passed into the corresponding GetProgress API",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"force":{
			   "description": "Indicates whether to gracefully roll back and clean up internal system state modified by executing the user-induced operation.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"timeout":{
			   "description": "The server timeout for performing the operation in seconds. This timeout specifies the time duration that the client is willing to wait for the requested operation to complete. The default value for this parameter is 60 seconds.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"error":{
			   "description": "Error object containing error code and error message.",
			   "type": "Optional[String[1]]"
			}
			
	}
}