{
	"description": "Asynchronously creates a new storage account with the specified parameters. If an account is already created and a subsequent create request is issued with different properties, the account properties will be updated. If an account is already created and a subsequent create or update request is issued with the exact same set of properties, the request will succeed.",
	"input_method": "stdin",
	"parameters":{
		
		
		
		
		    
			"resource_group_name":{
			   "description": "The name of the resource group within the user's subscription. The name is case insensitive.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"parameters":{
			   "description": "The parameters to provide for the created account.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"tags":{
			   "description": "Gets or sets a list of key value pairs that describe the resource. These tags can be used for viewing and grouping this resource (across resource groups). A maximum of 15 tags can be provided for a resource. Each tag must have a key with a length no greater than 128 characters and a value with a length no greater than 256 characters.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"identity":{
			   "description": "The identity of the resource.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"properties":{
			   "description": "The parameters used to create the storage account.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"location":{
			   "description": "Required. Gets or sets the location of the resource. This will be one of the supported and registered Azure Geo Regions (e.g. West US, East US, Southeast Asia, etc.). The geo region of a resource cannot be changed once it is created, but if an identical geo region is specified on update, the request will succeed.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"account_name":{
			   "description": "The name of the storage account within the specified resource group. Storage account names must be between 3 and 24 characters in length and use numbers and lower-case letters only.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"api_version":{
			   "description": "The API version to use for this operation.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"subscription_id":{
			   "description": "The ID of the target subscription.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"sku":{
			   "description": "Required. Gets or sets the SKU name.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"kind":{
			   "description": "Required. Indicates the type of storage account.",
			   "type": "Optional[String[1]]"
			}
			
	}
}